tutorials/incompressible/pimpleRemeshFoam/flapped_0010-64/flap_Cl05_40deg_bien/system/PIDcontrolDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      PIDcontrolDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PIDcontroller
{
    type            PID;
    P               -0.6067;
    I               -9.921;
    D               3.036e-5;
    controlDelay    1;
    actuatorModel   linear;
    actuatorModelCoeffs
    {
        angleMax        0.349066;
        angleMin        -0.349066;
        omegaMax        0.7; // 40 deg/s
        omegaMin        -0.7;
    }
    controlTarget   1;
    controlledVarData
    {
        type            lforces;
        libs            ( lforces );
        patches         ( main flap );
        rho             rhoInf;
        rhoInf          1;
        CofR            ( 0.25 0 0 );
        liftDir         ( 0 1 0 );
        dragDir         ( 1 0 0 );
        pitchAxis       ( 0 0 1 );
        magUInf         1;
        lRef            1;
        Aref            1;
        direction       2;
        setPoint        0.5;
        initialValue    0;
    }
    rollingAverage
    {
        type            average;
        functionObject  forceCoeffs;
        fields          ( Cl Cd );
        tolerance       0.001;
        window          0.05;
        windowType      exact;
    }
}


// ************************************************************************* //
