tutorials/incompressible/pimpleRemeshFoam/flapped_0010-64/flap_Cl05_40deg_bien/Allrun
# !/bin/sh
cd "${0%/*}" || exit  # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions  # Tutorial run functions
# ------------------------------------------------------------------------------

foamJob pimpleFoam
foamLog log

# ------------------------------------------------------------------------------
